# Задание №1

print("Glo", "Academy", sep=" ")
print()
print("Glo Academy")

print("Glo Academy", "Glo Academy", sep="\n\n")

# Задание №2
print("Как тебя зовут?")
name = input()
print("Привет,", "{", name, "}")

# Задание №3

name = input("Привет, давай познакомимся с тобой? Как тебя зовут?")
surname = input("А теперь я хочу узнать твою фамилию! Какая твоя фамилия?")
patronymic = input("И на последок, скажи мне твое отчество, пожалуйста!")

print(f'Я рад с тобой познакомиться!{name}-{surname}-{patronymic}')
